thaletterb/STM32-SSD1306-128x64-I2C/SSD1306/main.c
};



// Function Prototypes
void Delay(uint32_t nTime);


/* Private functions ---------------------------------------------------------*/

static void init_timer3(void){
// Initialize and enable interrupts on timer 3 every 1 second
// 1) Initiailze Timer 3
// 2) Enable Interrupt
// 3) Enable Timer
// 4) Enable interrupts:w


    TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;                  // Timer init structure    

    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, ENABLE);            // Enable the clocks to Tim3 periph

    TIM_TimeBaseStructInit(&TIM_TimeBaseStructure);
    TIM_TimeBaseStructure.TIM_Prescaler = SystemCoreClock/1000 - 1; // Prescaler 
    TIM_TimeBaseStructure.TIM_Period = 1000 - 1;                    // Auto Reload Register ARR (0..999)
    TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;     // Count up
    TIM_TimeBaseInit(TIM3, &TIM_TimeBaseStructure);                 // Enable timer

    TIM_ITConfig(TIM3, TIM_IT_Update, ENABLE);                      // Enable interrupt

    TIM_Cmd(TIM3, ENABLE);                                          // Enable timer

    NVIC_EnableIRQ(TIM3_IRQn);                                      // Enable Interrupts

}

void TIM3_IRQHandler(void){
// Timer 3 Interrupt Handler
    #define LED_BLUE_GPIO GPIOC
    #define LED_BLUE_PIN 8

    // Update the time values
    my_system_time.seconds++;
    if(my_system_time.seconds > 59){
        my_system_time.seconds = 0;
        my_system_time.minutes++;
    }
    if(my_system_time.minutes > 59){
        my_system_time.minutes = 0;
        my_system_time.hours++;
    }
    if(my_system_time.hours > 12){
        my_system_time.hours = 1;
    }
    
    // Update display
    switch(my_system_status.current_state){
        case clock_state:
            //GPIO_WriteBit(GPIOC, GPIO_Pin_9, 1);
            break;
        case pattern_state:
            //GPIO_WriteBit(GPIOC, GPIO_Pin_9, 0);
            break;
    }
                

    // Toggle the LEDs
    if (TIM_GetFlagStatus(TIM3, TIM_FLAG_Update) != RESET) {
        static int led_val = 0;
        TIM_ClearFlag(TIM3, TIM_IT_Update);
        GPIO_WriteBit(GPIOC, GPIO_Pin_8, 0);       // blue LED
        //GPIO_WriteBit(GPIOC, GPIO_Pin_8, led_val ? 1 : 0);       // blue LED
        led_val = 1-led_val;
    }

}

void init_error_led_pin(void){
    // Green LED is on PC9, Blue LED is on PC8
    GPIO_InitTypeDef GPIO_InitStructure;

    // Enable peripheral Clocks
    // Enable clocks for GPIO Port C
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);

    // Configure Pins
    // Pin PC9 must be configured as an output
    GPIO_StructInit(&GPIO_InitStructure);
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_9 | GPIO_Pin_8;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_Init(GPIOC, &GPIO_InitStructure);
}

void turn_on_error_led_pin(void){
    GPIO_WriteBit(GPIOC, GPIO_Pin_9, 1);
    //GPIO_WriteBit(GPIOC, GPIO_Pin_8, 1);
}
void turn_off_error_led_pin(void){
    GPIO_WriteBit(GPIOC, GPIO_Pin_9, 0);
}

void init_user_button(void){
    GPIO_InitTypeDef GPIO_InitStructure;

    // Enable peripheral clocks to GPIO Port A
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

    // Configure Button - Attached to PA0
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;

    GPIO_Init(GPIOA, &GPIO_InitStructure);

}

uint8_t read_user_button_state(void){
    return GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_0);
}

int i2c_send_command(I2C_TypeDef *I2Cx, uint8_t slave_address, uint8_t slave_data){
// Sends I2C data over I2Cx:
//  1) Sends Start Condition. Checks for I2C EV5 
//  2) Sends 7 bit address & checks for EV6
//  3) Sends 8 bit command byte (0x00) & checks for EV8
//  4) Sends 8 bits (1 byte) of data & checks for EV8
//  5) Sends Stop Condition
    int TimeOut;

    #define COMMAND_BYTE 0x00

    /* Send I2C1 START condition */
    I2C_GenerateSTART(I2Cx, ENABLE);

    /* Test on I2C1 EV5 and clear it */
    TimeOut = I2C_TIMEOUT;
    while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_MODE_SELECT))
    {
        TimeOut--;
        if (TimeOut == 0){
            turn_on_error_led_pin();       // Error LED
            return 1;
        }
    }

    /* Send SSD1306 7 bit slave Address for write. Check to make sure ACK received */
    I2C_Send7bitAddress(I2Cx, I2C1_SSD1306_SLAVE_ADDRESS8, I2C_Direction_Transmitter);

    //Test on I2C1 EV6 and clear it
    TimeOut = I2C_TIMEOUT;
    while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
    {
        TimeOut--;
        if (TimeOut == 0){
            // Send I2C1 STOP Condition
            I2C_GenerateSTOP(I2Cx, ENABLE);
            turn_on_error_led_pin();        // Error LED

            return 2;
        }
    }
    I2C_SendData(I2Cx, COMMAND_BYTE);
    while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_TRANSMITTED)){ // Wait for EV8
        TimeOut--;
        if (TimeOut == 0){
            // Send I2C1 STOP Condition
            I2C_GenerateSTOP(I2Cx, ENABLE);
            turn_on_error_led_pin();        // Error LED

            return 2;
        }
    }
    I2C_SendData(I2Cx, slave_data);
    while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_TRANSMITTED)){ // Wait for EV8
        TimeOut--;
        if (TimeOut == 0){
            // Send I2C1 STOP Condition
            I2C_GenerateSTOP(I2Cx, ENABLE);
            turn_on_error_led_pin();        // Error LED

            return 2;
        }
    }
    I2C_GenerateSTOP(I2Cx, ENABLE);
}

void ssd1306_i2c_init(I2C_TypeDef *I2Cx, uint8_t ssd1306_slave_address){
// Sends the init commands to the display
    i2c_send_command(I2Cx, ssd1306_slave_address, 0xAE);

    i2c_send_command(I2Cx, ssd1306_slave_address, 0x00 | 0x0);      // low col = 0

    i2c_send_command(I2Cx, ssd1306_slave_address, 0x10 | 0x0);      // hi col = 0
    i2c_send_command(I2Cx, ssd1306_slave_address, 0x40 | 0x0);      // line #0

    i2c_send_command(I2Cx, ssd1306_slave_address, 0x81);            // Set Contrast 0x81
    i2c_send_command(I2Cx, ssd1306_slave_address, 0xCF);
    i2c_send_command(I2Cx, ssd1306_slave_address, 0xA1);            // Segremap - 0xA1
    i2c_send_command(I2Cx, ssd1306_slave_address, 0xC8);            // COMSCAN DEC 0xC8 C0
    i2c_send_command(I2Cx, ssd1306_slave_address, 0xA6);            // Normal Display 0xA6 (Invert A7)

