thaletterb/STM32-SSD1306-128x64-I2C/SSD1306/main.c
    i2c_send_command(I2Cx, ssd1306_slave_address, 0xA4);            // DISPLAY ALL ON RESUME - 0xA4
    i2c_send_command(I2Cx, ssd1306_slave_address, 0xA8);            // Set Multiplex 0xA8
    i2c_send_command(I2Cx, ssd1306_slave_address, 0x3F);            // 1/64 Duty Cycle 

    i2c_send_command(I2Cx, ssd1306_slave_address, 0xD3);            // Set Display Offset 0xD3
    i2c_send_command(I2Cx, ssd1306_slave_address, 0x0);             // no offset

    i2c_send_command(I2Cx, ssd1306_slave_address, 0xD5);            // Set Display Clk Div 0xD5
    i2c_send_command(I2Cx, ssd1306_slave_address, 0x80);            // Recommneded resistor ratio 0x80

    i2c_send_command(I2Cx, ssd1306_slave_address, 0xD9);            // Set Precharge 0xd9
    i2c_send_command(I2Cx, ssd1306_slave_address, 0xF1);

    i2c_send_command(I2Cx, ssd1306_slave_address, 0xDA);            // Set COM Pins0xDA
    i2c_send_command(I2Cx, ssd1306_slave_address, 0x12);

    i2c_send_command(I2Cx, ssd1306_slave_address, 0xDB);            // Set VCOM Detect - 0xDB
    i2c_send_command(I2Cx, ssd1306_slave_address, 0x40);

    i2c_send_command(I2Cx, ssd1306_slave_address, 0x20);            // Set Memory Addressing Mode
    i2c_send_command(I2Cx, ssd1306_slave_address, 0x00);            // 0x00 - Horizontal

    i2c_send_command(I2Cx, ssd1306_slave_address, 0x40 | 0x0);      // Set start line at line 0 - 0x40 

    i2c_send_command(I2Cx, ssd1306_slave_address, 0x8D);            // Charge Pump -0x8D
    i2c_send_command(I2Cx, ssd1306_slave_address, 0x14);


    i2c_send_command(I2Cx, ssd1306_slave_address, 0xA4);            //--turn on all pixels - A5. Regular mode A4
    i2c_send_command(I2Cx, ssd1306_slave_address, 0xAF);            //--turn on oled panel - AF
}

int ssd1306_i2c_draw_buffer(I2C_TypeDef *I2Cx, uint8_t slave_address, uint8_t *buffer_pointer){
    #define SSD1306_COLUMNADDR  0x21
    #define SSD1306_PAGEADDR    0x22
    #define DATA_BYTE           0x40

    int TimeOut;

    i2c_send_command(I2Cx, slave_address, SSD1306_COLUMNADDR);
    i2c_send_command(I2Cx, slave_address, 0x00);            // Column Start address
    i2c_send_command(I2Cx, slave_address, 127);             // Column end address

    i2c_send_command(I2Cx, slave_address, SSD1306_PAGEADDR);
    i2c_send_command(I2Cx, slave_address, 0x00);            // Page Start address
    i2c_send_command(I2Cx, slave_address, 0x07);            // Page end address

    uint16_t i=0;
    uint8_t x, y;


    /* Send I2C1 START condition */
    I2C_GenerateSTART(I2Cx, ENABLE);

    /* Test on I2C1 EV5 and clear it */
    TimeOut = I2C_TIMEOUT;
    while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_MODE_SELECT))
    {
        TimeOut--;
        if (TimeOut == 0){
            turn_on_error_led_pin();       // Error LED
            return 1;
        }
    }

    /* Send SSD1306 7 bit slave Address for write. Check to make sure ACK received */
    I2C_Send7bitAddress(I2Cx, slave_address, I2C_Direction_Transmitter);

    //Test on I2C1 EV6 and clear it
    TimeOut = I2C_TIMEOUT;
    while(!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
    {
        TimeOut--;
        if (TimeOut == 0){
            // Send I2C1 STOP Condition
            I2C_GenerateSTOP(I2Cx, ENABLE);
            turn_on_error_led_pin();        // Error LED

            return 2;
        }
    }

    I2C_SendData(I2Cx, DATA_BYTE);
    while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_TRANSMITTED)){ // Wait for EV8
        TimeOut--;
        if (TimeOut == 0){
            // Send I2C1 STOP Condition
            I2C_GenerateSTOP(I2Cx, ENABLE);
            turn_on_error_led_pin();        // Error LED

            return 2;
        }
    }

    for(y=0; y<8; y++){
        for(x=0; x<128; x++){
            //I2C_SendData(I2Cx, const_global_display_buffer[(128*y)+x]);
            I2C_SendData(I2Cx, buffer_pointer[(128*y)+x]);
            while (!I2C_CheckEvent(I2Cx, I2C_EVENT_MASTER_BYTE_TRANSMITTED)){ // Wait for EV8
                TimeOut--;
                if (TimeOut == 0){
                    // Send I2C1 STOP Condition
                    I2C_GenerateSTOP(I2Cx, ENABLE);
                    turn_on_error_led_pin();        // Error LED

                    return 2;
                }
            }
        }
    }
    I2C_GenerateSTOP(I2Cx, ENABLE);
}

void ssd1306_clear_display_buffer(uint8_t *buffer_pointer){
// Clear all bytes of the 128x64 display buffer given by buffer_pointer
    uint8_t x, page_index = 0;
    #define NUM_PAGES       8
    #define SSD1306_XRES    128

    for(page_index=0; page_index < NUM_PAGES; page_index++){
        for(x=0; x<SSD1306_XRES; x++){
            buffer_pointer[(128*page_index)+x] = 0x00;
        }
    }
}

void ssd1306_draw_pixel_to_buffer(uint8_t x, uint8_t y, uint8_t* buffer_pointer){
// Turns on the pixel at (x,y) in the local buffer
    #define SSD1306_HORIZONTAL_RES  128

    uint8_t which_bit, which_page, bit_mask, value = 0;
    uint16_t which_byte; 

    which_page = y / 8;             // There are 8 vertical pixels per page
    which_byte = x + (SSD1306_HORIZONTAL_RES * which_page);
    which_bit = y % 8;

    bit_mask = (1<<which_bit);
    
    buffer_pointer[which_byte] = (buffer_pointer[which_byte] & ~bit_mask) | ((1<<which_bit) & bit_mask);
}

uint32_t isqrt32(uint32_t n){
    uint32_t root, remainder, place;

    root = 0;
    remainder = n;
    place = 0x40000000;

    while(place > remainder)
        place = place >> 2;
    while(place){
        if(remainder >= root + place){
            remainder = remainder - root - place;
            root = root + (place << 1);
        }
        root = root >> 1;
        place = place >> 2;
    }
    return root;

}

void ssd1306_draw_circle_to_buffer(uint8_t x, uint8_t y, uint8_t radius, uint8_t* buffer_pointer){
// Draws a circle of radius centered at (x,y) 
    uint16_t x_square, y_square, radius_square;
    uint8_t i=0;
    uint8_t y_calc = 0;

    x_square = x * x;
    radius_square = radius * radius;

    // General equation of circle
    // (x-h)^2 + (y-k)^2 = r^2
    // (y-k)^2 = r^2 - (x-h)^2
    // y-k = sqrt(r^2 - (x-h)^2)
    // y = sqrt(r^2 - (x-h)^2) + k

    // (h, k) origin

    for(i=x-radius; i<=x+radius; i++){
        y_calc = isqrt32(radius_square - (i-x)*(i-x)) + y;
        ssd1306_draw_pixel_to_buffer(i, y_calc, global_display_buffer); 
        y_calc = -1 * isqrt32(radius_square - (i-x)*(i-x)) + y;
        ssd1306_draw_pixel_to_buffer(i, y_calc, global_display_buffer); 
    }
}

