thaletterb/STM32-SSD1306-128x64-I2C/SSD1306/main.c
void ssd1306_draw_char_to_buffer(uint8_t x, uint8_t page_num, uint8_t which_char, uint8_t *buffer_pointer){
// Draws 'which_char' to the display buffer given by buffer_pointer at coord (x, page_num)

    uint8_t i;
    uint16_t which_byte = 0;

    //GPIO_WriteBit(GPIOC, GPIO_Pin_9, 0);       // Error LED

    //which_byte = x + ((page_num/8)*128);
    which_byte = x + ((page_num)*128);
    
    for(i=0; i<5; i++){
        buffer_pointer[which_byte+i] = Ascii_8x5_font[which_char-ASCII_8x5_OFFSET][i];
        //turn_on_error_led_pin();       // Error LED
    }

}
void ssd1306_draw_big_char_to_buffer(uint8_t x, uint8_t page_num, uint8_t which_char, uint8_t *buffer_pointer){
// Draws 'which_char' to the display buffer given by buffer_pointer at coord (x, page_num)
    uint8_t i, j;
    uint16_t which_byte = 0;

    which_byte = x + ((page_num)*128);
    
    for(j=0; j<5; j++){
    // 40 bits (5 bytes) tall
        which_byte = x + ((page_num+j)*128);
        for(i=0; i<24; i++){
        // 24 bits wide
            buffer_pointer[which_byte+i] = Tahoma24x40[which_char-ASCII_24x40_FONT_ASCII_OFFSET][(24*j)+i];
            //turn_on_error_led_pin();       // Error LED
        }
    }

}

void ssd1306_draw_string_to_buffer(uint8_t x, uint8_t page_num, uint8_t *string, uint8_t *buffer_pointer){
// Draws 'string' to the display buffer (buffer pointer) at coord (x, page_num)

    uint8_t i=0;
    while(string[i] != 0){
        ssd1306_draw_char_to_buffer(x+(5*i), page_num, string[i], buffer_pointer);
        i++;
    }
}

void ssd1306_draw_big_string_to_buffer(uint8_t x, uint8_t page_num, uint8_t *string, uint8_t *buffer_pointer){
// Draws 'string' to the display buffer (buffer pointer) at coord (x, page_num)

    uint8_t i=0;
    while(string[i] != 0){
        ssd1306_draw_big_char_to_buffer(x+(ASCII_24x40_FONT_WIDTH*i), page_num, string[i], buffer_pointer);
        i++;
    }
}


void init_i2c1_peripheral(I2C_TypeDef *I2Cx){
// Initializes the I2C1 Peripheral on PB6 & PB7
// 1) Enables the GPIOB Peripheral Clock
// 2) Enable the I2C1 Peripheral Clock
// 3) Configure the GPIO peripheral with GPIO_InitStructure and GPIO_Init()
// 4) Configure the I2C1 peripheral with I2C_InitStructure and I2C_Init() 

    GPIO_InitTypeDef GPIO_InitStructure;
    I2C_InitTypeDef I2C_InitStructure;

    /* GPIOB Periph clock enable */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);

    /* I2C1 and I2C2 Periph clock enable */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE);

    /* Configure I2C1 pins: SCL and SDA ----------------------------------------*/
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD; // Open Drain, I2C bus pulled high externally
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    /* Enable I2C1 -------------------------------------------------------------*/
    I2C_DeInit(I2C1);

    I2C_Cmd(I2C1, ENABLE);

    /* I2C1 configuration ------------------------------------------------------*/
    I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
    I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
    I2C_InitStructure.I2C_OwnAddress1 = 0x039;                                  // This is important for some reason!
    //I2C_InitStructure.I2C_OwnAddress1 = 0x000;
    I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
    I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
    I2C_InitStructure.I2C_ClockSpeed = I2C_SPEED;
    I2C_Init(I2C1, &I2C_InitStructure);
}



int main(void){
    int TimeOut;
    const uint8_t *global_buffer_ptr = global_display_buffer;

    init_system_time(my_system_time);
    init_error_led_pin();
    turn_off_error_led_pin();

    init_timer3();
    init_user_button();

    GPIO_InitTypeDef GPIO_InitStructure1;

    //Configure SysTick Timer
    //if (SysTick_Config(SystemCoreClock / 100000))
    if (SysTick_Config(SystemCoreClock / 1000))
        while (1);

    /*----- Configure I2C Phase -----*/
    init_i2c1_peripheral(I2C1);                                               // To Do - Move All this into init_i2c1_peripheral()
    
    /*----- Transmission Phase -----*/
    // Init sequence for 128x64 OLED module
    ssd1306_i2c_init(I2C1, I2C1_SSD1306_SLAVE_ADDRESS8);
   
    // Draw the buffer
    ssd1306_i2c_draw_buffer(I2C1, I2C1_SSD1306_SLAVE_ADDRESS8, global_display_buffer);
    Delay(1000);
    

    ssd1306_clear_display_buffer(global_display_buffer);
    ssd1306_draw_pixel_to_buffer(64, 50, global_display_buffer);
    ssd1306_i2c_draw_buffer(I2C1, I2C1_SSD1306_SLAVE_ADDRESS8, global_display_buffer);

    uint8_t square_root_result = 0;
    uint16_t array_index;
    
    while(1){
        ssd1306_clear_display_buffer(global_display_buffer);
        switch(my_system_status.current_state){
            case clock_state:
                ssd1306_draw_big_char_to_buffer(0, 0, my_system_time.minutes/10 + '0', global_display_buffer);
                ssd1306_draw_big_char_to_buffer(24, 0, my_system_time.minutes%10 + '0', global_display_buffer);
                ssd1306_draw_big_char_to_buffer(48, 0, ':', global_display_buffer);
                ssd1306_draw_big_char_to_buffer(72, 0, my_system_time.seconds/10 + '0', global_display_buffer);
                ssd1306_draw_big_char_to_buffer(96, 0, my_system_time.seconds%10 + '0', global_display_buffer);
                break;
            case pattern_state:
                ssd1306_draw_circle_to_buffer(64, 32, 15, global_display_buffer);
                ssd1306_draw_circle_to_buffer(64, 32, 13, global_display_buffer);
                ssd1306_draw_circle_to_buffer(64, 32, 11, global_display_buffer);
                ssd1306_draw_circle_to_buffer(64, 32, 9, global_display_buffer);
                ssd1306_draw_circle_to_buffer(64, 32, 7, global_display_buffer);
                ssd1306_draw_circle_to_buffer(64, 32, 5, global_display_buffer);
                ssd1306_draw_circle_to_buffer(64, 32, 3, global_display_buffer);
                break;
            } 

        ssd1306_i2c_draw_buffer(I2C1, I2C1_SSD1306_SLAVE_ADDRESS8, global_display_buffer);
        Delay(250);

