thaletterb/STM32-SSD1306-128x64-I2C/SSD1306/main.c
    }
    /* Scratch are follow until the end of main
    *  aka never gets down to thse below
    *
    *  Useful for testing new/old functions
    */

    // Loop forever printng strings and patterns
    while(1){
        // Draw the big nums
        ssd1306_clear_display_buffer(global_display_buffer);
        ssd1306_draw_big_string_to_buffer(0, 0, "12:00", global_display_buffer);      // Loop through
        ssd1306_i2c_draw_buffer(I2C1, I2C1_SSD1306_SLAVE_ADDRESS8, global_display_buffer);
        Delay(5000);

        uint16_t array_index;
        ssd1306_draw_char_to_buffer(0, 0, 'A', global_display_buffer);
        ssd1306_draw_string_to_buffer(0, 1, "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz", global_display_buffer);
        ssd1306_i2c_draw_buffer(I2C1, I2C1_SSD1306_SLAVE_ADDRESS8, global_display_buffer);

        Delay(5000);

        for(array_index=1; array_index < ((128*64)/8); array_index++){
            global_display_buffer[array_index]=0xAA;
        }

        ssd1306_i2c_draw_buffer(I2C1, I2C1_SSD1306_SLAVE_ADDRESS8, global_display_buffer);

        Delay(5000);

        for(array_index=0; array_index < ((128*64)/8); array_index++){
            global_display_buffer[array_index]=0x11;
        }

        ssd1306_i2c_draw_buffer(I2C1, I2C1_SSD1306_SLAVE_ADDRESS8, global_display_buffer);

        Delay(5000);

        for(array_index=0; array_index < ((128*64)/8); array_index++){
            global_display_buffer[array_index]=0x00;
        }

        ssd1306_i2c_draw_buffer(I2C1, I2C1_SSD1306_SLAVE_ADDRESS8, global_display_buffer);
    }

}

// Timer code
static __IO uint32_t TimingDelay;

void Delay(uint32_t nTime){
    TimingDelay = nTime;
    while(TimingDelay != 0);
}

uint8_t button_status;                  // Holds the debounced status of the user button



my_states_t get_next_state(my_states_t current_state){
    my_states_t next_state;

    switch(current_state){
        case clock_state:
            next_state = pattern_state;
            break;
        case pattern_state:
            next_state = clock_state;
            break;
     }
    return next_state;
}

void SysTick_Handler(void){
// SysTick interrupt handler - Configured to run every 1ms

    const uint8_t debounce_time = 100;
    static uint16_t pressed_counter = 0;
    static uint16_t not_pressed_counter = 0;
    // Delay
    if (TimingDelay != 0x00)
        TimingDelay--;

    // Debounce user button on PA0
    current_button_status = GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_0);

    if(!current_button_status){
        GPIO_WriteBit(GPIOC, GPIO_Pin_8, 0);
        not_pressed_counter++;
        pressed_counter=0;
        if(not_pressed_counter >= debounce_time){
            not_pressed_counter = debounce_time +1;
            //my_system_status.current_state = my_system_status.current_state;
        }
    }
    else{
        //GPIO_WriteBit(GPIOC, GPIO_Pin_8, 1);
        not_pressed_counter=0;
        pressed_counter++;
        if(pressed_counter >= debounce_time){
            GPIO_WriteBit(GPIOC, GPIO_Pin_8, 1);
            pressed_counter = debounce_time+1;
            //button_status = 1;
            my_system_status.current_state = get_next_state(my_system_status.current_state);
        }
    }
}

#ifdef USE_FULL_ASSERT
void assert_failed(uint8_t* file, uint32_t line){
    /* Infinite loop */
    /* Use GDB to find out why we're here */
    while(1);
}
#endif
